// จงเขียน function ที่ใช้คำนวณว่า เข็มสั้นกับเข็มยาวในเวลาต่างๆ ในนาฬิกา เข็มห่างกันกี่องศา โปรแกรมจะรับเวลาได้เฉพาะหน่วยเวลาแบบ 12 ชั่วโมงเท่านั้น
// ตัวอย่าง input: 9:00 ouput: 90 | input 5:30 output:15 input 5:45 output 97.5



const resultArr = []; // ไว้เก็บผลลัพธ์เป็น array
function degTimeCal(input) {  // คำนวณตำแหน่งที่แตกต่างของเข็มสั้นกับยาว
    let timeH = Number(input.split(':')[0]) // แยกออกมาตำแหน่งที่ 1
    let timeM = Number(input.split(':')[1]) // แยกออกมาตำแหน่งที่ 2
    let degM = (timeM / 60) * 360; // ส่วนนี้ต้องคำนวณก่อน เพราะจะเอาไปคำนวณเข็มชั่วโมงแบบละเอียด

    if (degM == 0) { // ส่วนนี้เพิ่มเติมไว้ เพราะแก้ปัญหา 00 นาทีจะเอาไปหาองศาไม่ได้
        degM = 360;
    }

    let degPlus = 0;
    if (timeH && timeM !== 0) { // แก้ปัญหาค่า 00:00 ไม่เอามาคำนวน เพราะมันจะเพี้ยนเอา
        degPlus = ((degM / 360) * 30);
    }

    let degH = ((timeH / 12) * 360) + degPlus; // ส่วนนี้คำนวณชั่วโมง แล้วก็บวกองศาอีกนิดถ้ามันเดิมไปหลายนาที
    if (degH == 0) { // ถ้าคำนวรณแล้วได้ 0 ชั่วโมง มันก็หาความต่างองศาลำบากเนาะ
        degH = 360;
    }
    let degDif = Math.abs(degH - degM).toFixed(2); // หามุมของเข็มสองเข็ม แล้วแสดงทศนิยมสองหลัก มาเป็นคู่จริงๆ 
    resultArr.push(`เวลาของ : ${input} มีองศาเข็มสั้นและยาวแตกต่างกันอยู่ = ${degDif} deg`) // เอาไปเก็บ
    console.log(`เวลาของ : ${input} มีองศาเข็มสั้นและยาวแตกต่างกันอยู่ = ${degDif} deg`); // แสดงหน่อย
    return degDif;
}

degTimeCal('09:00')
degTimeCal('05:30')
degTimeCal('05:45')
degTimeCal('12:14')
degTimeCal('03:33')
degTimeCal('08:55')
degTimeCal('00:01')
console.log(degTimeCal('00:00'));

console.log(resultArr);
console.log(`degTimeCal('00:00') เปลี่ยนเวลาของคุณในฟังก์ชั่น แล้วลองดูว่า เข็มนาฬิกาจะทำองศาต่อกันเท่าไร`);